Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64GP204.h
#define _RCFGCAL_CAL2_POSITION                   0x00000002
#define _RCFGCAL_CAL2_MASK                       0x00000004
#define _RCFGCAL_CAL2_LENGTH                     0x00000001

#define _RCFGCAL_CAL3_POSITION                   0x00000003
#define _RCFGCAL_CAL3_MASK                       0x00000008
#define _RCFGCAL_CAL3_LENGTH                     0x00000001

#define _RCFGCAL_CAL4_POSITION                   0x00000004
#define _RCFGCAL_CAL4_MASK                       0x00000010
#define _RCFGCAL_CAL4_LENGTH                     0x00000001

#define _RCFGCAL_CAL5_POSITION                   0x00000005
#define _RCFGCAL_CAL5_MASK                       0x00000020
#define _RCFGCAL_CAL5_LENGTH                     0x00000001

#define _RCFGCAL_CAL6_POSITION                   0x00000006
#define _RCFGCAL_CAL6_MASK                       0x00000040
#define _RCFGCAL_CAL6_LENGTH                     0x00000001

#define _RCFGCAL_CAL7_POSITION                   0x00000007
#define _RCFGCAL_CAL7_MASK                       0x00000080
#define _RCFGCAL_CAL7_LENGTH                     0x00000001

#define _RCFGCAL_RTCPTR0_POSITION                0x00000008
#define _RCFGCAL_RTCPTR0_MASK                    0x00000100
#define _RCFGCAL_RTCPTR0_LENGTH                  0x00000001

#define _RCFGCAL_RTCPTR1_POSITION                0x00000009
#define _RCFGCAL_RTCPTR1_MASK                    0x00000200
#define _RCFGCAL_RTCPTR1_LENGTH                  0x00000001

#define _CMCON_C1POS_POSITION                    0x00000000
#define _CMCON_C1POS_MASK                        0x00000001
#define _CMCON_C1POS_LENGTH                      0x00000001

#define _CMCON_C1NEG_POSITION                    0x00000001
#define _CMCON_C1NEG_MASK                        0x00000002
#define _CMCON_C1NEG_LENGTH                      0x00000001

#define _CMCON_C2POS_POSITION                    0x00000002
#define _CMCON_C2POS_MASK                        0x00000004
#define _CMCON_C2POS_LENGTH                      0x00000001

#define _CMCON_C2NEG_POSITION                    0x00000003
#define _CMCON_C2NEG_MASK                        0x00000008
#define _CMCON_C2NEG_LENGTH                      0x00000001

#define _CMCON_C1INV_POSITION                    0x00000004
#define _CMCON_C1INV_MASK                        0x00000010
#define _CMCON_C1INV_LENGTH                      0x00000001

#define _CMCON_C2INV_POSITION                    0x00000005
#define _CMCON_C2INV_MASK                        0x00000020
#define _CMCON_C2INV_LENGTH                      0x00000001

#define _CMCON_C1OUT_POSITION                    0x00000006
#define _CMCON_C1OUT_MASK                        0x00000040
#define _CMCON_C1OUT_LENGTH                      0x00000001

#define _CMCON_C2OUT_POSITION                    0x00000007
#define _CMCON_C2OUT_MASK                        0x00000080
#define _CMCON_C2OUT_LENGTH                      0x00000001

#define _CMCON_C1OUTEN_POSITION                  0x00000008
#define _CMCON_C1OUTEN_MASK                      0x00000100
#define _CMCON_C1OUTEN_LENGTH                    0x00000001

#define _CMCON_C2OUTEN_POSITION                  0x00000009
#define _CMCON_C2OUTEN_MASK                      0x00000200
#define _CMCON_C2OUTEN_LENGTH                    0x00000001

#define _CMCON_C1EN_POSITION                     0x0000000A
#define _CMCON_C1EN_MASK                         0x00000400
#define _CMCON_C1EN_LENGTH                       0x00000001

#define _CMCON_C2EN_POSITION                     0x0000000B
#define _CMCON_C2EN_MASK                         0x00000800
#define _CMCON_C2EN_LENGTH                       0x00000001

#define _CMCON_C1EVT_POSITION                    0x0000000C
#define _CMCON_C1EVT_MASK                        0x00001000
#define _CMCON_C1EVT_LENGTH                      0x00000001

#define _CMCON_C2EVT_POSITION                    0x0000000D
#define _CMCON_C2EVT_MASK                        0x00002000
#define _CMCON_C2EVT_LENGTH                      0x00000001

#define _CMCON_CMIDL_POSITION                    0x0000000F
#define _CMCON_CMIDL_MASK                        0x00008000
#define _CMCON_CMIDL_LENGTH                      0x00000001

#define _CVRCON_CVR_POSITION                     0x00000000
#define _CVRCON_CVR_MASK                         0x0000000F
#define _CVRCON_CVR_LENGTH                       0x00000004

#define _CVRCON_CVRSS_POSITION                   0x00000004
#define _CVRCON_CVRSS_MASK                       0x00000010
#define _CVRCON_CVRSS_LENGTH                     0x00000001

#define _CVRCON_CVRR_POSITION                    0x00000005
#define _CVRCON_CVRR_MASK                        0x00000020
#define _CVRCON_CVRR_LENGTH                      0x00000001

#define _CVRCON_CVROE_POSITION                   0x00000006
#define _CVRCON_CVROE_MASK                       0x00000040
#define _CVRCON_CVROE_LENGTH                     0x00000001

#define _CVRCON_CVREN_POSITION                   0x00000007
#define _CVRCON_CVREN_MASK                       0x00000080
#define _CVRCON_CVREN_LENGTH                     0x00000001

#define _CVRCON_CVR0_POSITION                    0x00000000
#define _CVRCON_CVR0_MASK                        0x00000001
#define _CVRCON_CVR0_LENGTH                      0x00000001

#define _CVRCON_CVR1_POSITION                    0x00000001
#define _CVRCON_CVR1_MASK                        0x00000002
#define _CVRCON_CVR1_LENGTH                      0x00000001

#define _CVRCON_CVR2_POSITION                    0x00000002
#define _CVRCON_CVR2_MASK                        0x00000004
#define _CVRCON_CVR2_LENGTH                      0x00000001

#define _CVRCON_CVR3_POSITION                    0x00000003
#define _CVRCON_CVR3_MASK                        0x00000008
#define _CVRCON_CVR3_LENGTH                      0x00000001

#define _CRCCON_PLEN_POSITION                    0x00000000
#define _CRCCON_PLEN_MASK                        0x0000000F
#define _CRCCON_PLEN_LENGTH                      0x00000004

#define _CRCCON_CRCGO_POSITION                   0x00000004
#define _CRCCON_CRCGO_MASK                       0x00000010
#define _CRCCON_CRCGO_LENGTH                     0x00000001

#define _CRCCON_CRCMPT_POSITION                  0x00000006
#define _CRCCON_CRCMPT_MASK                      0x00000040
#define _CRCCON_CRCMPT_LENGTH                    0x00000001

